Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum
View configuration type for IFC 4 export

Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum.UNDEFINED


Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum.REFERENCE_VIEW


Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum.DESIGN_TRANSFER_VIEW


Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum.PRECAST_VIEW


Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum.MEP_REFERENCE_VIEW


Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum.MEP_DESIGN_TRANSFER_VIEW


Tekla.Structures.Model.Operations.Operation.IFCExportViewTypeEnum.BRIDGE_VIEW
